In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([])

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1,2,3],[3,4,5]])

In [5]:
print(df1)

   0  1  2
0  1  2  3
1  3  4  5

In [6]:
df1.head(2)

   0  1  2
0  1  2  3
1  3  4  5

In [7]:
df1.tail(2)

   0  1  2
0  1  2  3
1  3  4  5

In [8]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [9]:
pd.__version__

'1.4.3'

In [10]:
s1 = [1,2,3]

In [11]:
pd.Series(s1, index=["a","b","c"])

a    1
b    2
c    3
dtype: int64

In [12]:
print(df1.loc[0,0])

1

In [13]:
df2 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,0,1,2],[3,4,5,6],[7,8,9,0]], columns=['A1','A2','A3','A4'])

In [14]:
df2.shape

(5, 4)

In [15]:
df2

   A1  A2  A3  A4
0   1   2   3   4
1   5   6   7   8
2   9   0   1   2
3   3   4   5   6
4   7   8   9   0

In [16]:
df2.iloc[0:2,0:3]

   A1  A2  A3
0   1   2   3
1   5   6   7

In [17]:
df2.iloc[2,3]

2

In [18]:
df2.iloc[0:2,0:4]

   A1  A2  A3  A4
0   1   2   3   4
1   5   6   7   8

In [19]:
df2.iloc[0:2,0:4].shape

(2, 4)

In [20]:
df2.drop(axis=0,columns='A1')

   A2  A3  A4
0   2   3   4
1   6   7   8
2   0   1   2
3   4   5   6
4   8   9   0

In [21]:
df2.drop(index=[0,2,3])

   A1  A2  A3  A4
1   5   6   7   8
4   7   8   9   0